In [1]:
a = 23
print(type(a))

<class 'int'>

In [2]:
b = 45
print(type(b))

<class 'int'>

In [3]:
c = [1, 2, 3, 4, 5]
print(type(c))

<class 'list'>

In [4]:
c.append(10)

In [5]:
c

[1, 2, 3, 4, 5, 10]

In [6]:
d = {
    101: "Utkarsh",
    102: "Rahul",
    103: "Raman"
}
print(type(d))

<class 'dict'>

In [7]:
emp = {
    "id": [101, 102, 103],
    "name": ["Raman", "Rahul", "Aditi"],
    "dept": ["HR", "Sales", "Engg."],
    "sal": [27000, 32000, 48000]
}

In [8]:
type(emp)

dict

In [9]:
import pandas as pd
df = pd.DataFrame(emp)

In [10]:
df

    id   name   dept    sal
0  101  Raman     HR  27000
1  102  Rahul  Sales  32000
2  103  Aditi  Engg.  48000

In [11]:
print(type(df))

<class 'pandas.core.frame.DataFrame'>

In [12]:
df.shape

(3, 4)

In [13]:
df.columns

Index(['id', 'name', 'dept', 'sal'], dtype='object')

In [14]:
df.index

RangeIndex(start=0, stop=3, step=1)

In [15]:
df.dtypes

id       int64
name    object
dept    object
sal      int64
dtype: object

In [16]:
df.values

array([[101, 'Raman', 'HR', 27000],
       [102, 'Rahul', 'Sales', 32000],
       [103, 'Aditi', 'Engg.', 48000]], dtype=object)

In [17]:
type(df.values)

numpy.ndarray

In [18]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   id      3 non-null      int64
 1   name    3 non-null      object
 2   dept    3 non-null      object
 3   sal     3 non-null      int64
dtypes: int64(2), object(2)
memory usage: 228.0+ bytes

In [19]:
df.sort_values(by="sal", ascending=False)

    id   name   dept    sal
2  103  Aditi  Engg.  48000
1  102  Rahul  Sales  32000
0  101  Raman     HR  27000

In [20]:
df.agg({"sal": ["sum", "mean"]})

                sal
sum   107000.000000
mean   35666.666667

In [21]:
df.head(2)

    id   name   dept    sal
0  101  Raman     HR  27000
1  102  Rahul  Sales  32000

In [22]:
class Person:

    # Store the attributes of class in constructor function
    def __init__(self, name, age, gender, occupation):
        self.name = name
        self.age = age
        self.gender = gender
        self.occupation = occupation

    # You can create as many functions as you want in above
    def introduce(self):
        print(f"My name is {self.name}")
        print(f"I am {self.age} years old")
        print(f"I am {self.gender}")
        print(f"I work as a {self.occupation}")

In [23]:
p1 = Person("Utkarsh", 30, "Male", "Engineer")
p1

In [24]:
print(type(p1))

<class '__main__.Person'>

In [25]:
p1.name

'Utkarsh'

In [26]:
p1.age

30

In [27]:
p1.gender

'Male'

In [28]:
p1.occupation

'Engineer'

In [29]:
p1.occupation = "Data Scientist"

In [30]:
p1.occupation

'Data Scientist'

In [31]:
p1.introduce()

My name is Utkarsh
I am 30 years old
I am Male
I work as a Data Scientist

In [32]:
p2 = Person(name="Aditi", age=28, gender="Female", occupation="HR")
type(p2)

__main__.Person

In [33]:
p2.name

'Aditi'

In [34]:
p2.introduce()

My name is Aditi
I am 28 years old
I am Female
I work as a HR

In [35]:

p3 = Person(30, "Raman", "Sales", 124)

In [37]:
p3.introduce()

My name is 30
I am Raman years old
I am Sales
I work as a 124

In [38]:
from dataclasses import dataclass
from typing import Literal

In [39]:
@dataclass
class Person2:
    name: str
    age: int
    gender: Literal["male", "female"]
    occupation: str

    def __post_init__(self):
        errors = []

        if type(self.name) != str:
            errors.append("Name should be a string")
        if type(self.age) != int or (self.age <= 0):
            errors.append("Age should be a positive integer")
        if self.gender not in ["male", "female"]:
            errors.append("Gender should be either male or female")
        if type(self.occupation) != str:
            errors.append("Occupation should be a string")

        if errors:
            raise ValueError("\n".join(errors))
        
    def intro(self):
        print(f"My name is {self.name}")
        print(f"I am {self.age} years old")
        print(f"I am {self.gender}")
        print(f"I work as {self.occupation}")

In [40]:
p4 = Person2(name= "Rahul", age=35, gender="male", occupation="Purchase")
p4

Person2(name='Rahul', age=35, gender='male', occupation='Purchase')

In [41]:
type(p4)

__main__.Person2

In [42]:
p4.intro()

My name is Rahul
I am 35 years old
I am male
I work as Purchase

In [43]:
p6 = Person2(name="Priyanka", age=38, gender="female", occupation="Engg.")

In [44]:
p6.intro()

My name is Priyanka
I am 38 years old
I am female
I work as Engg.